/*
 * UR_100030SW.c
 *
 *  Created on: 2019-9-29
 *      Author: root
 */
/*
 * UR_100030SW.c
 *
 *  Created on: 2019-9-3
 *      Author: root
 */
/*
* *******************************************************************************
*	@(#)Copyright (C) 2013-2020
* *******************************************************************************
*/
/*
* *******************************************************************************
*                                  Include
* *******************************************************************************
*/
#include <time.h>
#include "UR_100030SW.h"
#include "dlog.h"
#include "timer.h"
#include "can_api.h"
#include "log_sys.h"
/**************************************************************************************
1、优优绿能的模块没有获取具体温度值的指令；
答：十进制的30 就是读取模块环境温度的CommandType；温度是摄氏度   1000倍

2、优优绿能的模块电压值的单位是mV，电流值的单位是mA,和台达中兴兼容时，注意换算；

3、同组内的电源模块的地址是如何设置的？有没有设置地址的指令？
答：设置模块地址对于30KW有两种方法：
    1.通过面板按键手动设定；
    2.通过系统端背板地址板拨码设置地址，这样模块会根据位置自动识别地址，不需要手动设置。

4、优优绿能的模块电压和电流值的设定是分开的两条CAN报文，是先发电压值，再发
   电流值吗？发完电压电流值的指令后，是否发送开机指令？
答：先电压或先电流都可以；需要发送开机指令；

5、优优绿能的模块如何设置组地址，数据格式协议中没有说明；
答：数据域就是想设置的组地址，3就是3，1就是1；

6、发完电压电流的设定值后，是不是再发送开机指令？
答：开机之前一定要设置相应的电压与电流才能开机  否则就是默认的电压电流值；

7、默认的电压电流值是多少？
答：默认的电压值应该是150V吧  有的模块是200V  电流值是最大的  50060是80A  75040是50A

****************************************************************************************/
/*
* *******************************************************************************
*                                  Define
* *******************************************************************************
*/

#define 	CAN_NO 		CAN0

/*****************************优优绿能 CANID********************************************/
#define LNMOD_PROTOCOL				(1)						// 当前的协议版本号
#define LNMOD_MONITORADDR			(1)						// 监控器地址
#define LNMOD_PRODUCTIONDAY			(0)						// 生产日期
#define LNMOD_SERIALNUMLOWPART		(0)						// 序列号低位
/*****************************优优绿能 CANID结束****************************************/

/******************BYTE0 信息类型(高4位为组地址，低4位位信息类型)*************************/
#define LN_SET_MOD_PARA				(0x00)					// 设置模块参数
#define LN_SET_MOD_PARA_REPLY		(0x01)					// 模块设置应答
#define LN_GET_MOD_PARA				(0x02)					// 读模块信息
#define LN_GET_MOD_PARA_REPLY		(0x03)					// 模块读信息应答
/******************BYTE0 END***********************************************************/

/******************BYTE1 命令信息类型(高4位为组地址，低4位位信息类型)*********************/
#define LN_GET_MOD_OUTVOL_R			(0)					    // 模块输出电压(只读)
#define LN_GET_MOD_OUTCUR_R			(48)					// 模块输出电流(只读)
#define LN_SET_MODVOL_WR			(2)					    // 模块输出电压设定值(读写)
#define LN_SET_MODCUR_WR			(3)					    // 模块输出限流点设定值(读写)
#define LN_SET_MOD_ONOFF_W			(4)					    // DCDC模块开关机(只写)
#define LN_GET_MOD_STATUS_R			(8)					    // 模块状态标志位(只读)
#define LN_GET_MODABVOL_R			(20)					// 线电压 AB(只读)
#define LN_GET_MODBCVOL_R			(21)					// 线电压 BC(只读)
#define LN_GET_MODCAVOL_R			(22)					// 线电压 CA(只读)
#define LN_SET_GROUP_WR				(89)					// 组地址(读写)
#define LN_GET_MODTMP_R				(30)					// 环境温度(只读)
#define LN_SET_HLVOL_W				(0x5F)					// 设置高低压模式
#define LN_GET_MOD_MODEL_R			(0x60)					// 读取高低压模式
/******************BYTE1 END***********************************************************/
#define LN_MOD_START				(0)						// 模块开机
#define LN_MOD_STOP					(1)						// 模块关机

#define LN_MOD_RESERVED				(0)						// 优优绿能数据帧中的保留位默认值
#define MOD_CAN_LEN					(8)						// 模块发送的CAN报文长度

#define MASSIGNID(addr)			(ASSIGNID|addr)
#define MSKIP(addr)				(SKIP|addr)
#define MSTART(addr)			(START|addr)
/*
* *******************************************************************************
*                                  Enum
* *******************************************************************************
*/
typedef enum mod_id_enum
{
	DISCONNECT			= 		0x0,
	START,
}MDL_ID_ENUM;

typedef enum mdl_ctrl_enum
{
	MDL_CTRL_FREE,
	MDL_CTRL_OUTPUT,
	MDL_CTRL_STOP,
//	MDL_CTRL_SWITCHING,
}MDL_CTRL_ENUM;
/*
* *******************************************************************************
*                                  Struct
* *******************************************************************************
*/
#pragma pack(1)

typedef union
{
	uint32_t      all;
	struct
	{     			// bits  description
	   uint32_t    SerialNumberLo:9;  			// 0:8
	   uint32_t	   ProductionDay:5;  			// 9:13
	   uint32_t    ModuleAddress:7;  			// 14:20
	   uint32_t    MonitorAddress:4;   			// 21:24
	   uint32_t	   Protocol:4; 					// 25:28

	   uint32_t    TXRQ:1;          			// 29
	   uint32_t    RTR:1;          				// 30
	   uint32_t    IDE:1;          				// 31
	}NormalBits;
}YYLN_CANMSGID;

struct  NORMAL_BITS
{      // bits   description
	uint32_t      SnHi_FrameNumber:16;		// 0:15
	uint32_t      CommandType:8;			// 16:23
	uint32_t      MessageType:4;    	   	// 24:27
	uint32_t      ModuleGroup:4;  		   	// 28:31
};

struct  CAN_L_BYTES
{      // bits   description
	uint32_t      BYTE3:8;     // 0:7
	uint32_t      BYTE2:8;     // 8:15
	uint32_t      BYTE1:8;     // 16:23
	uint32_t      BYTE0:8;     // 24:31
};

typedef union
{
	uint32_t                		all;
	struct  CAN_L_BYTES   			byte;
	struct  NORMAL_BITS				NormalBits;
}CAN_L_REG;

struct  CAN_H_BYTES
{      // bits   description
	uint32_t      BYTE7:8;     // 0:7
	uint32_t      BYTE6:8;     // 8:15
	uint32_t      BYTE5:8;     // 16:23
	uint32_t      BYTE4:8;     // 24:31
};

typedef union
{
	uint32_t                  	all;
	struct CAN_H_BYTES     		byte;
}CAN_H_REG;

struct STATUS_BITS
{
	uint16_t AcOV:1; 			// 0 交流输入过压
	uint16_t AcUV:1; 			// 1 交流输入欠压
	uint16_t AcOVDisconnected:1;// 2 交流输入过压脱离
	uint16_t Reserved_3:1; 		// 3
	uint16_t Reserved_4:1; 		// 4
	uint16_t Reserved_5:1; 		// 5
	uint16_t DcOV:1; 			// 6 直流输出过压
	uint16_t DcOVShutDown:1; 	// 7 直流输出过压关机
	uint16_t DcUV:1; 			// 8 直流输出欠压
	uint16_t FanNotRun:1;		// 9 风扇故障
	uint16_t Reserved_10:1; 	// 10
	uint16_t Reserved_11:1; 	// 11
	uint16_t AmbientOT:1; 		// 12 环境温度过温保护
	uint16_t Reserved_13:1; 	// 13
	uint16_t Pfc1_OT:1; 		// 14 PFC过温保护1
	uint16_t Pfc2_OT:1; 		// 15 PFC过温保护2
	uint16_t Dcdc1_OT:1; 		// 16 DC过温保护1
	uint16_t Dcdc2_OT:1; 		// 17 DC过温保护2
	uint16_t SciIsNotOK:1; 		// 18 原副边通信故障
	uint16_t Reserved_19:1; 	// 19
	uint16_t PfcFail:1; 		// 20 原边故障
	uint16_t DcdcFail:1; 		// 21 副边故障
	uint16_t Reserved_22:1; 	// 22
	uint16_t Reserved_23:1; 	// 23
	uint16_t Reserved_24:1; 	// 24
	uint16_t DcdcNotRun:1; 		// 25 开关机状态
	uint16_t Reserved_2627:2; 	// 26:27
	uint16_t Reserved_28:1; 	// 28
	uint16_t Reserved_29:1; 	// 29
	uint16_t Reserved_30:1; 	// 30
	uint16_t Reserved_31:1; 	// 31
};

typedef union
{
	uint32_t all;
	struct STATUS_BITS bit;
}STATUS_REG;


typedef struct
{
	STATUS_REG			sta;

	MDL_INFO_STRUCT 	mdl;
	unsigned int 		id;
	MDL_ID_ENUM			step;

	MDL_CTRL_ENUM 		ctrl;			//

	int 				sendSNFlag;		// 0-未发送，1-已发送， 2-收到

	unsigned long   	pingTick;		// ping计数
	unsigned long 		readTick;		// 读取电压电流的计数
	unsigned long 		aliveTick;		// alive计数，超时认为掉线
	unsigned long 		settingTick;	// 输出命令计数
	unsigned long 		modeTick;		// 读取高低压模式的计数

	unsigned long		workTime;		// 总共工作时间，单位S
	unsigned long		workTick;		// 每当工作时间达到一个间隔(比如5秒)，就加入到workTime中
}MDL_INFO_PRIVATE_STRUCT;

#pragma pack()

/*
* *******************************************************************************
*                                  Public variables
* *******************************************************************************
*/

/*
* *******************************************************************************
*                                  Private variables
