/*
* *******************************************************************************
*    @(#)Copyright (C) 2013-2020
* *******************************************************************************
*/
/*
* *******************************************************************************
* FILE NAME			: fanCtrl.h
* SYSTEM NAME		: 风扇控制
* BLOCK NAME		:
* PROGRAM NAME		:
* MDLULE FORM		:
* -------------------------------------------------------------------------------
* AUTHOR			: wenlong wan
* DEPARTMENT		:
* DATE				: 20200214
* *******************************************************************************
*/

#ifndef __FANCTRL_H__
#define __FANCTRL_H__

/*
* *******************************************************************************
*                                  Include
* *******************************************************************************
*/

#include "option.h"

/*
* *******************************************************************************
*                                  Define
* *******************************************************************************
*/

#define 	FAN_EBM			1		// ebm风扇
#define 	FAN_PWM			2		// pwm风扇

/*
* *******************************************************************************
*                                  Enum
* *******************************************************************************
*/


/*
* *******************************************************************************
*                                  Union
* *******************************************************************************
*/


/*
* *******************************************************************************
*                                  Struct
* *******************************************************************************
*/
#pragma pack(1)

typedef struct
{
	unsigned char 	fanNum;			// 风扇数量
	unsigned char 	fanType;		// 风扇类型
}FAN_PARA_STRUCT;

typedef struct
{
	int speed;				// 转速
	int temp;				// 温度
	int runTime;			// 运行时间，单位s
	int error;				// 故障信息
	int warning;			// 警告信息
	int online;				// 风机通信，0-掉线 1-在线
	int currentcmd;			// 
}FAN_INFO_STRUCT;

typedef struct
{
	void			(*Init)(void);
	void			(*Uninit)(void);
	int				(*SetSpeed)(int addr, int speed);						// 设置转速
	int 			(*GetInfo)(int addr, FAN_INFO_STRUCT *pInfo);			// 获得风扇数据
}FAN_FUNCTIONS_STRUCT;

#pragma pack()

/*
* *******************************************************************************
*                                  Extern
* *******************************************************************************
*/

int FanCtrl_GetInfo(FAN_INFO_STRUCT *pInfo, int fanNo);
void FanCtrl_SetPara(FAN_PARA_STRUCT para);
void FanCtrl_SetSpeed(int speed);

void FanCtrl_Deal();
void FanCtrl_Init();
void FanCtrl_Uninit();

#endif // __FANCTRL_H__
