/*
* *******************************************************************************
*    @(#)Copyright (C) 2013-2020
* *******************************************************************************
*/
/*
* *******************************************************************************
* FILE NAME			: fanEBM.h
* SYSTEM NAME		: EBM风扇，MODBUS协议
* BLOCK NAME		:
* PROGRAM NAME		:
* MDLULE FORM		:
* -------------------------------------------------------------------------------
* AUTHOR			: wenlong wan
* DEPARTMENT		:
* DATE				: 20200221
* *******************************************************************************
*/

#ifndef __FANEBM_H__
#define __FANEBM_H__

/*
* *******************************************************************************
*                                  Include
* *******************************************************************************
*/

#include "option.h"
#include "../fanCtrl.h"

/*
* *******************************************************************************
*                                  Define
* *******************************************************************************
*/

/*
* *******************************************************************************
*                                  Enum
* *******************************************************************************
*/


/*
* *******************************************************************************
*                                  Union
* *******************************************************************************
*/


/*
* *******************************************************************************
*                                  Struct
* *******************************************************************************
*/

#pragma pack(1)

typedef struct
{
	short reserve1 : 3;			// 保留
	short ErrUzLow : 1;			// 直流母线欠压
	short reserve2 : 4;			// 保留
	short ErrBLK   : 1;			// 风机叶轮锁住
	short ErrHALL  : 1;			// 内部霍尔传感器失效
	short ErrFB    : 1;			// 风扇故障总标志位
	short ErrSKF   : 1;			// 主从控制器通信故障
	short ErrTFE   : 1;			// 电源模块过热
	short reserve3 : 1;			// 保留
	short ErrPHA   : 1;			// 相位故障或缺相
}FAN_ERRINFO_STRUCT;

typedef struct
{
	short WarLRF        : 1;			// sheding function激活
	short WarUeHigh     : 1;			// 供电过压
	short reserve       : 1;			// 保留
	short WarUzHigh     : 1;			// 直流母线过压
	short WarHeating    : 1;			// 过热功能启动
	short WarCableBreak : 1;			// 模拟量输入电缆断开
	short WarNLow       : 1;			// 转速过低
	short WarBrake      : 1;			// 制动警告
	short WarUzLow      : 1;			// 直流母线欠压
	short WarTEIhigh    : 1;			// 电子元件内部过热
	short WarTMhigh     : 1;			// 风机马达过热
	short WarTEhigh     : 1;			// 电源模块过热
	short WarPlimit     : 1;			// 处于限功率状态
	short WarLhigh      : 1;			// 母线阻抗过高
	short WarLlimit     : 1;			// 处于限流状态
}FAN_WARINFO_STRUCT;

#pragma pack()

/*
* *******************************************************************************
*                                  Extern
* *******************************************************************************
*/

FAN_FUNCTIONS_STRUCT *Get_FanEBM_Functions(void);

#endif // __FANEBM_H__
